[
{"summary":"How complex of the complex networks has attracted many researchers to explore it. The entropy is an useful method to describe the degree of the $complex$ of the complex networks. In this paper, a new method which is based on the Tsallis entropy is proposed to describe the $complex$ of the complex networks. The results in this paper show that the complex of the complex networks not only decided by the structure property of the complex networks, but also influenced by the relationship between each nodes. In other word, which kinds of nodes are chosen as the main part of the complex networks will influence the value of the entropy of the complex networks. The value of q in the Tsallis entropy of the complex networks is used to decided which kinds of nodes will be chosen as the main part in the complex networks. The proposed Tsallis entropy of the complex networks is a generalised method to describe the property of the complex networks."},
{"summary":"A large variety of interacting complex systems are characterized by interactions occurring between more than two nodes. These systems are described by simplicial complexes. Simplicial complexes are formed by simplices (nodes, links, triangles, tetrahedra etc.) that have a natural geometric interpretation. As such simplicial complexes are widely used in quantum gravity approaches that involve a discretization of spacetime. Here, by extending our knowledge of growing complex networks to growing simplicial complexes we investigate the nature of the emergent geometry of complex networks and explore whether this geometry is hyperbolic. Specifically we show that an hyperbolic network geometry emerges spontaneously from models of growing simplicial complexes that are purely combinatorial. The statistical and geometrical properties of the growing simplicial complexes strongly depend on their dimensionality and display the major universal properties of real complex networks (scale-free degree distribution, small-world and communities) at the same time. Interestingly, when the network dynamics includes an heterogeneous fitness of the faces, the growing simplicial complex can undergo phase transitions that are reflected by relevant changes in the network geometry."},
{"summary":"A complex network is said to show topological isotropy if the topological structure around a particular node looks the same in all directions of the whole network. Topologically anisotropic networks are those where the local neighborhood around a node is not reproduced at large scale for the whole network. The existence of topological isotropy is investigated by the existence of a power-law scaling between a local and a global topological characteristic of complex networks obtained from graph spectra. We investigate this structural characteristic of complex networks and its consequences for 32 real-world networks representing informational, technological, biological, social and ecological systems."},
{"summary":"We use the concept of the network communicability (Phys. Rev. E 77 (2008) 036111) to define communities in a complex network. The communities are defined as the cliques of a communicability graph, which has the same set of nodes as the complex network and links determined by the communicability function. Then, the problem of finding the network communities is transformed to an all-clique problem of the communicability graph. We discuss the efficiency of this algorithm of community detection. In addition, we extend here the concept of the communicability to account for the strength of the interactions between the nodes by using the concept of inverse temperature of the network. Finally, we develop an algorithm to manage the different degrees of overlapping between the communities in a complex network. We then analyze the USA airport network, for which we successfully detect two big communities of the eastern airports and of the western/central airports as well as two bridging central communities. In striking contrast, a well-known algorithm groups all but two of the continental airports into one community."}
]